{
    "lang-title": "Switch to hungarian",
    "theme-title": "Toggle theme",

    "main-hero-intro": "Hi, I'm Attila Wittner",
    "main-hero-sub1": "I'm an IT student building interactive web apps and experimenting with UI/UX design as well as backend setups.",
    "main-hero-sub2": "I specialize in front- and back-end development, I enjoy turning ideas into engaging digital experiences I also enjoy making games!",
    "main-hero-image": "Attila Wittner, IT student",
    "main-hero-more": "Learn more about me",

    "main-project-title-featured": "Featured Project",
    "main-project-title-realm": "REALM - TTRPG (In active development)",
    "main-project-description-realm": "REALM is a TTRPG (tabletop role-playing game) inspired by Dungeons & Dragons. The project is under active development and is structured as logically separated services within a monorepo using TypeScript, Node.js, and Phaser.js.\n\nI designed and implemented the networking layer from scratch using WebSockets. The game is structured around classic fantasy races and classes, with an emphasis on teamwork and cooperative gameplay.",
    "main-project-more-best": "More about REALM",
    "main-project-title-other": "Other Projects",
    "main-project-title-deal-gone-dark": "Deal Gone Dark - 2D Stealth PvP Action Game",
    "main-project-description-deal-gone-dark": "Deal Gone Dark is a 2D stealth action game where players take on the role of a robber infiltrating a casino. The game features pre-generated levels, full 2-5 player multiplayer support. Developed using TypeScript and Phaser.js with Colyseus as the server, the project focuses on creating an enjoyable experience with semi-dynamic lighting and sound design.",
    "main-project-more-deal-gone-dark": "More about Deal Gone Dark",
    "main-project-title-agent-q": "AgentQ - Quiz Website",
    "main-project-description-agent-q": "AgentQ was based on popular quiz websites like Redmenta and Quizlet. It allows users to create, share, and play quizzes in a competitive multiplayer environment. Built with TypeScript, React, and Node.js, the project emphasizes user engagement through an agent style quiz taker website",
    "main-project-more-agent-q": "More about AgentQ",

    "main-page-tech-title": "Technologies",
    "main-page-tech-description": "Here are some of the technologies and languages I have experience with:",
    "main-page-tech-more": "More about the technologies",

    "footer-main": "Main Page",
    "footer-about": "About Me",
    "footer-projects": "Projects",
    "footer-techs": "Technologies",

    "page-tech-title": "Technologies",
    "page-tech-subtitle": "The Languages, Frameworks & Tools I use daily in large-scale and smaller projects, while some of them are general use others are just experiments (like docker) and I only use them to have experience with it if one day I need to utilize it.",
    "page-tech-languages": "Languages",
    "page-tech-game-engines": "Game Engines",
    "page-tech-frameworks-&-libraries": "Frameworks & Libraries",
    "page-tech-databases": "Databases",
    "page-tech-version-control-&-tools": "Version Control & Tools",

    "page-tech-javascript-desc": "I've used JavaScript extensively for both front-end and back-end development, building interactive web applications and server-side logic. Earlier projects relied heavily on Node.js and Express.js, before I transitioned to TypeScript.",
    "page-tech-typescript-desc": "TypeScript has been my primary language for several years. I use it to build robust web applications, develop games with Phaser.js, and create server-side applications with Node.js. It's my go-to language for both simple and complex tasks, as it combines the flexibility of scripting with the safety of strong typing.",
    "page-tech-csharp-desc": "C# was the first strongly typed language I learned. I initially used it to build simple console applications, then moved on to object-oriented programming concepts. While I have solid experience with it, it is not my primary choice today due to ecosystem preferences compared to other languages I use.",
    "page-tech-html-desc": "HTML is the foundation of web development, and I've used it extensively to structure web pages and applications. My experience includes writing semantic HTML5 that is accessible and SEO-friendly.",
    "page-tech-css-desc": "CSS is essential for styling web pages and applications. I've used it to create responsive layouts, animations, and modern UI designs that improve user experience.",

    "page-tech-unity-desc": "Unity is a powerful game engine I've used to develop both 2D and 3D games. While these projects were experimental, I gained experience with C# scripting, the Unity Editor, and implementing core gameplay mechanics.",
    "page-tech-unreal-engine-desc": "Unreal Engine is a high-end game engine I've worked with to create visually impressive projects. My experience includes using Blueprints for rapid prototyping, with a particular focus on VR development.",
    "page-tech-phaser-desc": "Phaser is an HTML5 game framework I've used to develop 2D games. My experience includes core game development concepts, implementing physics mechanics, and handling animations.",

    "page-tech-react-desc": "React is a JavaScript library I use to build dynamic and interactive user interfaces. My experience includes creating reusable components, managing state with hooks, and optimizing performance through the virtual DOM.",
    "page-tech-node-js-desc": "Node.js is a runtime environment I use for building server-side applications. My experience includes developing REST APIs, handling asynchronous operations, and integrating databases.",
    "page-tech-express-js-desc": "Express.js goes hand in hand with Node.js. I've used it as the primary backend framework in my projects to handle routing, middleware, and server-side application logic.",
    "page-tech-vite-desc": "Vite is a build tool I use to create fast, modern, and efficient development environments for web applications.",

    "page-tech-mysql-desc": "MySQL is a relational database management system I've used to store, query, and manage structured data across multiple projects.",
    "page-tech-mongodb-desc": "MongoDB is a NoSQL database I've used for storing and retrieving unstructured data in scalable, backend-driven applications.",

    "page-tech-git-github-desc": "Git and GitHub are version control tools I use extensively for managing repositories, collaborating with others, and tracking code changes.",
    "page-tech-vscode-desc": "Visual Studio Code is my primary code editor, where I write, debug, and manage all of my projects efficiently.",
    "page-tech-docker-desc": "While I wouldn't call myself a Docker expert, I've used it to containerize applications, manage dependencies, and improve development workflows.",

    "page-tech-project-portfolio": "Personal Portfolio Website",
    "page-tech-project-realm": "REALM",
    "page-tech-project-deal-gone-dark": "Deal Gone Dark",
    "page-tech-project-agent-q": "AgentQ",
    "page-tech-project-school-js": "JavaScript School Projects",
    "page-tech-project-school-cs": "C# School Projects",
    "page-tech-project-school-web": "Web Development School Projects",
    "page-tech-project-unity": "Unity Projects",

    "page-project-card-exam": "Final Exam Project",
    "page-project-card-realm": "REALM",
    "page-project-card-agentq": "Agent Q",
    "page-project-card-dgd": "Deal Gone Dark",
    "page-project-card-school-js": "School JavaScript",
    "page-project-card-school-cs": "School C#",

    "page-project-card-description-exam": "A Project we made for the final exam of our education in SZSZC Vasvári Pál Technical School's IT specialist course.",
    "page-project-card-description-realm": "REALM is my solo project that's currently in active development. It's a TTRPG (tabletop role-playing game) inspired by Dungeons & Dragons, built with TypeScript, Node.js, and Phaser.js.",
    "page-project-card-description-agentq": "Agent Q was my first ever gamified web application with basic quiz taking and making capabilities, built with TypeScript, React, and Node.js.",
    "page-project-card-description-dgd": "Deal Gone Dark is a 2D stealth action game where players take on the role of a robber infiltrating a casino. Developed using TypeScript and Phaser.js with Colyseus as the server.",
    "page-project-card-description-school-js": "School JavaScript projects were given to me during my studies at SZSZC Vasvári Pál Technical School's IT specialist course.",
    "page-project-card-description-school-cs": "School C# projects were given to me during my studies at SZSZC Vasvári Pál Technical School's IT specialist course.",

    "time-dropdown-2026": "Exam Project and This Website",
    "time-dropdown-content-2026": "The final year of my education was spent working on our final exam project and this portfolio website. We put a huge amount of effort into the end-of-year exam — it wasn't just an obstacle, but a real gateway into professional coding. We made sure to plan carefully and build it as well as we could. We spent hours designing, coding, and refining it, and we're even hoping to sell it to the Szeged Zoo.",

    "time-dropdown-2025": "Games with Phaser.js and Web Projects",
    "time-dropdown-content-2025": "This was the year we moved into a more independent workspace provided by our school. We started building projects that were more realistic and actually useful. Alongside school work, I also began focusing more on my own personal projects. I created games using Phaser.js, and with my existing Unreal Engine knowledge, I had a great time turning ideas into real, playable experiences.",

    "time-dropdown-2024": "C# OOP and Desktop Development",
    "time-dropdown-content-2024": "One of the biggest turning points was switching to C# — no pun intended. After working with simpler scripting languages, we dove head-first into a large, strongly-typed language. After years of using VS Code, moving to Visual Studio felt intimidating at first, but once we got comfortable, we built several desktop applications with database integration.",

    "time-dropdown-2023": "JavaScript and Web Development",
    "time-dropdown-content-2023": "After building a solid foundation in web development, we started using JavaScript as a true programming language rather than just something inside HTML. We created basic Node.js apps, and as the year progressed, we developed backend systems for our own frontends. We built smaller APIs that were perfect for understanding how different layers of an application work together.",

    "time-dropdown-2022": "HTML and CSS Static Pages",
    "time-dropdown-content-2022": "Around 2022, we started learning coding at school with our first HTML and CSS websites. Nothing too fancy — just the basics, like every frontend developer starts. Over time, we created more serious and creative websites while experimenting as much as possible.",

    "time-dropdown-2021": "Basic Python and CMDs",
    "time-dropdown-content-2021": "After what I thought was 'learning' Python, I started my most ambitious project at the time: a fully Python-powered AI assistant. I implemented speech recognition, commands, console automation, and even Google searches. It was close to completion, but life got in the way and I unfortunately had to abandon the project.",

    "time-dropdown-2020": "Scratch and Python Courses",
    "time-dropdown-content-2020": "I attended a Scratch course hosted by EPAM in Szeged, where we learned the fundamentals and created several small games. A few months later, I joined a Python course they also hosted, where we learned how to use the language in a more in-depth and practical way.",

    "time-dropdown-2019": "UE4 and Python Experiments",
    "time-dropdown-content-2019": "After about a year of using Unreal Engine, I became comfortable setting up basic gameplay systems and animations. I worked with downloaded models and integrated them into projects. Around this time, I also got into coding with Python. It was easy to pick up and fun to experiment with. My early projects included Rock-Paper-Scissors, text-to-speech tools, and speech recognition experiments.",

    "time-dropdown-2018": "UE4 and Unity Experiments",
    "time-dropdown-content-2018": "I started experimenting with Unreal Engine and Unity back in 2018. I left Unity fairly quickly, but Unreal Engine — especially its Blueprint system — helped me understand how game systems work. I experimented with third-person, first-person, and driving game concepts. None of these projects were finished, mainly because I lacked experience in 3D modelling at the time."
}
