{
    "lang-title": "Angolra váltás",
    "theme-title": "Téma váltása",

    "main-hero-intro": "Üdv, Wittner Attila vagyok",
    "main-hero-sub1": "IT hallgató vagyok, aki interaktív webalkalmazásokat fejleszt, valamint UI/UX dizájnnal és backend rendszerekkel kísérletezik.",
    "main-hero-sub2": "Front- és backend fejlesztésre specializálódom, szeretek ötleteket vonzó digitális élményekké alakítani, és időnként játékokat is készítek.",
    "main-hero-image": "Wittner Attila, IT hallgató",
    "main-hero-more": "Több információ rólam",

    "main-project-title-featured": "Kiemelt Projektem",
    "main-project-title-realm": "REALM - TTRPG (Aktív fejlesztés alatt)",
    "main-project-description-realm": "A REALM egy TTRPG (asztali szerepjáték), amelyet a Dungeons & Dragons ihletett. A projekt jelenleg fejlesztés alatt áll, strukturálisan logikailag elkülönített szolgáltatásokként egy monorepo keretein belüli épül TypeScript, Node.js és Phaser.js használatával.\n\nA hálózati réteget teljesen nulláról terveztem és valósítottam meg WebSocketek segítségével. A játék klasszikus fantasy fajok és osztályok köré épül, hangsúlyt fektetve a csapatmunkára és az együttműködő játékmenetre.",
    "main-project-more-best": "Több a REALM-ről",
    "main-project-title-other": " Egyébb Projektek",
    "main-project-title-deal-gone-dark": "Deal Gone Dark - 2D Lopakodós PvP Akciójáték",
    "main-project-description-deal-gone-dark": "A Deal Gone Dark egy 2D-s lopakodós akciójáték, ahol a játékosok egy kaszinót betörő rabló szerepét veszik át. A játék előre generált pályákat és teljes 2-5 játékos multiplayer támogatást kínál. A TypeScript és Phaser.js használatával, Colyseus szerverrel fejlesztett projekt a félig dinamikus világítással és hangtervezéssel nyújt élvezetes élményt.",
    "main-project-more-deal-gone-dark": "Több a Deal Gone Dark-ról",
    "main-project-title-agent-q": "K-Ügynök - Kvíz Weboldal",
    "main-project-description-agent-q": "Az AgentQ népszerű kvíz weboldalak, mint a Redmenta és a Quizlet alapján készült. Lehetővé teszi a felhasználók számára, hogy kvízeket hozzanak létre, osszanak meg és játsszanak egy versenyképes multiplayer környezetben. A TypeScript, React és Node.js használatával épített projekt a felhasználói elkötelezettséget helyezi előtérbe egy ügynök stílusú kvíz kitöltő weboldalon.",
    "main-project-more-agent-q": "Több az AgentQ-ról",

    "main-page-tech-title": "Technológiák",
    "main-page-tech-description": "Itt van néhány olyan technológia és nyelv, amivel tapasztalatom van:",
    "main-page-tech-more": "Több információ a technológiákról",

    "footer-main": "Főoldal",
    "footer-about": "Rólam",
    "footer-projects": "Projektek",
    "footer-techs": "Technológiák",

    "page-tech-title": "Technológiák",
    "page-tech-subtitle": "A nyelvek, keret-rendszerek és eszközök, amelyeket naponta használok nagyobb és kisebb projektekben, miközben néhányat általánosan használok, másokat csak kísérletezésre használok (például a docker), és csak azért használom őket, hogy tapasztalatom legyen velük, ha esetleg szükségem lenne rájuk.",
    "page-tech-languages": "Nyelvek",
    "page-tech-game-engines": "Játék Motorok",
    "page-tech-frameworks-&-libraries": "Keretek & Könyvtárak",
    "page-tech-databases": "Adatbázisok",
    "page-tech-version-control-&-tools": "Verziókezelés & Eszközök",

    "page-tech-javascript-desc": "A JavaScriptet széleskörűen használtam mind front-end, mind back-end fejlesztéshez, interaktív webalkalmazások és szerveroldali logika építésére. Korábbi projektjeimben főként a Node.js-t és az Express.js-t alkalmaztam, mielőtt megismerkedtem volna a TypeScript használatával.",
    "page-tech-typescript-desc": "A TypeScript az elmúlt években az elsődleges programozási nyelvemmé vált. Robusztus webalkalmazások, Phaser.js alapú játékok és Node.js-sel készült szerveroldali alkalmazások fejlesztésére használom. Számomra ez az ideális nyelv mind egyszerű, mind összetett feladatokhoz, mivel ötvözi a script nyelvek rugalmasságát és a statikusan típusos nyelvek előnyeit.",
    "page-tech-csharp-desc": "A C# volt az első statikusan típusos nyelv, amelyet megtanultam. Kezdetben egyszerű konzolos alkalmazásokat készítettem vele, majd fokozatosan elmélyültem az objektumorientált programozás alapjaiban. Bár rendelkezem tapasztalattal ezen a területen, ma már nem ez az elsődleges választásom más nyelvekhez képest.",
    "page-tech-html-desc": "A HTML a webfejlesztés alapja, és széleskörűen használtam weboldalak és alkalmazások strukturálásához. Tapasztalatom magában foglalja szemantikus, hozzáférhető és SEO-barát HTML5 dokumentumok készítését.",
    "page-tech-css-desc": "A CSS elengedhetetlen a weboldalak és alkalmazások megjelenésének kialakításához. Használtam reszponzív elrendezések, animációk és modern felhasználói felületek létrehozására, a jobb felhasználói élmény érdekében.",

    "page-tech-unity-desc": "Az Unity egy sokoldalú játékmotor, amelyet 2D és 3D játékok fejlesztésére használtam. Bár ezek a projektek elsősorban kísérleti jellegűek voltak, tapasztalatot szereztem a C# scriptingben, az Unity Editor használatában és az alapvető játékmenet-mechanikák megvalósításában.",
    "page-tech-unreal-engine-desc": "Az Unreal Engine egy magas szintű játékmotor, amelyet vizuálisan lenyűgöző projektek készítéséhez használtam. Tapasztalatom kiterjed a Blueprint rendszer használatára gyors prototípus-készítéshez, valamint elsősorban VR fejlesztéshez.",
    "page-tech-phaser-desc": "A Phaser egy HTML5 játékmotor, amelyet 2D játékok fejlesztésére használtam. Tapasztalatom kiterjed a játékfejlesztés alapjaira, a fizikai mechanizmusok implementálására és az animációk kezelésére.",

    "page-tech-react-desc": "A React egy JavaScript könyvtár, amelyet dinamikus felhasználói felületek fejlesztésére használok. Tapasztalatom magában foglalja az újrafelhasználható komponensek készítését, az állapotkezelést hookok segítségével, valamint a teljesítmény optimalizálását a virtuális DOM használatával.",
    "page-tech-node-js-desc": "A Node.js egy futtatókörnyezet, amelyet szerveroldali alkalmazások fejlesztésére használok. Tapasztalatom kiterjed REST API-k készítésére, aszinkron műveletek kezelésére és adatbázisok integrálására.",
    "page-tech-express-js-desc": "Az Express.js szorosan kapcsolódik a Node.js-hez; backend projektjeimben elsődleges keretrendszerként használtam útválasztás, middleware-ek és szerveroldali logika kezelésére.",
    "page-tech-vite-desc": "A Vite egy modern build eszköz, amelyet gyors és hatékony fejlesztői környezetek kialakítására használok webalkalmazások esetében.",

    "page-tech-mysql-desc": "A MySQL egy relációs adatbázis-kezelő rendszer, amelyet strukturált adatok tárolására és kezelésére használtam különböző projektekben.",
    "page-tech-mongodb-desc": "A MongoDB egy NoSQL adatbázis, amelyet strukturálatlan adatok tárolására és lekérdezésére használtam skálázható alkalmazásokban.",

    "page-tech-git-github-desc": "A Git és a GitHub verziókezelő eszközök, amelyeket rendszeresen használok kódtárak kezelésére, csapatmunkára és a változások nyomon követésére.",
    "page-tech-vscode-desc": "A Visual Studio Code az elsődleges kódszerkesztőm, amelyben a projektjeimet írom, debuggolom és kezelem.",
    "page-tech-docker-desc": "Bár nem tartom magam Docker szakértőnek, használtam alkalmazások konténerizálására, függőségek kezelésére és a fejlesztési munkafolyamatok egyszerűsítésére.",

    "page-tech-project-portfolio": "Személyes Portfolio Weboldal",
    "page-tech-project-realm": "REALM",
    "page-tech-project-deal-gone-dark": "Deal Gone Dark",
    "page-tech-project-agent-q": "K Ügynök",
    "page-tech-project-school-js": "JavaScript Iskolai Projektek",
    "page-tech-project-school-cs": "C# Iskolai Projektek",
    "page-tech-project-school-web": "Webfejlesztés Iskolai Projektek",
    "page-tech-project-unity": "Unity Projektek",

    "page-project-card-exam": "Szóbeli Vizsga Projektje",
    "page-project-card-realm": "REALM",
    "page-project-card-agentq": "K Ügynök",
    "page-project-card-dgd": "Deal Gone Dark",
    "page-project-card-school-js": "Iskolai JavaScript",
    "page-project-card-school-cs": "Iskolai C#",

    "page-project-card-description-exam": "Egy projekt, amelyet a SZSZC Vasvári Pál Technikum IT szakmai képzésének végzéseként készítettünk.",
    "page-project-card-description-realm": "A REALM az én egyedi projektjem, amely jelenleg aktív fejlesztés alatt áll. Ez egy TTRPG (asztali szerepjáték), amelyet a Dungeons & Dragons ihletett, TypeScript, Node.js és Phaser.js segítségével fejlesztve.",
    "page-project-card-description-agentq": "Az Agent Q volt az első gamifikált webalkalmazásom alapvető kvíz készítési és játszási funkcionalitással, TypeScript, React és Node.js segítségével fejlesztve.",
    "page-project-card-description-dgd": "A Deal Gone Dark egy 2D lopakodós akciójáték, ahol a játékosok egy kaszinót betörő rabló szerepét veszik fel. TypeScript és Phaser.js segítségével fejlesztve, a szerveroldalt a Colyseus kezeli.",
    "page-project-card-description-school-js": "Az iskolai JavaScript projektek a SZSZC Vasvári Pál Technikum IT szakmai képzése során kapott feladatok voltak.",
    "page-project-card-description-school-cs": "Az iskolai C# projektek a SZSZC Vasvári Pál Technikum IT szakmai képzése során kapott feladatok voltak.",

    "time-dropdown-2026": "Vizsgamunka és ez a weboldal",
    "time-dropdown-content-2026": "Oktatásunk utolsó évében a portfólió weboldalam és a vizsgamunka állt a középpontban. Nagyon sokat dolgoztunk rajta - nem csak egy akadály volt, amit át kellett lépni, hanem egy kapu a programozói világba. Nem csak elvégezni akartuk a feladatot, hanem a lehető legjobbra megcsinálni, és reménykedünk benne, hogy sikerül majd eladni a Szegedi Vadasparknak.",

    "time-dropdown-2025": "Játékok Phaser.js-ben és HTML-ben",
    "time-dropdown-content-2025": "Ebben az évben kerültem ki az iskola duális helyszínére, ahol elkezdtünk dolgozni saját, éles, ténylegesen hasznos és valós projekteken. Emellett saját projekteken is tudtam dolgozni. Ezek közé tartoztak a Phaser.js-es játékok is. A korábbi UE4-es tudásomat felhasználva könnyedén és élvezetesen tudtam ezeket megvalósítani.",

    "time-dropdown-2024": "C# OOP és asztali fejlesztés",
    "time-dropdown-content-2024": "A legélesebb váltás a C#-ra való áttérés volt. Miután évekig könnyű, script jellegű nyelveket használtunk, fejest ugrani egy nagy, ipari nyelvbe szokatlan volt. Sok év VS Code használat után a Visual Studio elsőre rémisztőnek tűnt, de miután megszoktuk, asztali alkalmazásokat fejlesztettünk mögöttes adatbázissal.",

    "time-dropdown-2023": "JavaScript és webfejlesztés",
    "time-dropdown-content-2023": "Miután stabil alapot kaptunk webalkalmazások készítéséhez, elkezdtünk a JavaScript-tel mint önálló nyelvvel foglalkozni. Készítettünk egyszerű Node alkalmazásokat, és ahogy haladt az év, egyre több és nagyobb rendszer kialakításában is részt vettünk. Kisebb API-khoz írtunk frontendet, ami tökéletes volt a két réteg összehangolásának megértéséhez.",

    "time-dropdown-2022": "HTML és CSS statikus oldalak",
    "time-dropdown-content-2022": "Körülbelül 2022-ben kezdtünk el ténylegesen kódolni az iskolában. Ekkor még csak HTML és CSS segítségével készítettünk kisebb weboldalakat, ahogy minden frontend fejlesztő kezdi. Voltak komolyabb és kreatívabb oldalak is, de közben végig arra fókuszáltunk, hogy minél több dolgot kipróbáljunk.",

    "time-dropdown-2021": "Alapszintű Python és CMD kód",
    "time-dropdown-content-2021": "Miután „megtanultam” Pythonozni - vagyis legalábbis azt hittem - nekikezdtem az addigi legnagyobb projektemnek: egy teljes körű AI asszisztens elkészítésének, teljesen Pythonra alapozva. Elég messzire jutottam: szöveges és konzolos bemenet, parancsérzékelés, Google-keresések. Viszont közbejöttek dolgok, és végül félbe kellett hagynom a projektet.",

    "time-dropdown-2020": "Python botok és Scratch",
    "time-dropdown-content-2020": "Részt vettem egy Scratch kurzuson, amit a Szegedi EPAM szervezett. Megtanították a Scratch működését és használatát, és több játékot is készítettünk. Néhány hónappal később jelentkeztem a Python kurzusukra is, ahol mélyebb oktatást kaptunk a nyelvről és annak használatáról.",

    "time-dropdown-2019": "UE4 és Python kísérletek",
    "time-dropdown-content-2019": "Közel egy év Unreal Engine használat után már elég gyorsan tudtam felépíteni kisebb demókat animációkkal és karakterekkel, amelyeket letöltött modellekkel egészítettem ki. Emellett az első kódjaimat is ekkor írtam Pythonban, amit nemcsak egyszerű volt megtanulni, de kisebb ötleteket megvalósítani is könnyű volt benne. Az első programjaim között volt a kő-papír-olló, szövegfelolvasó és beszédfelismerés.",

    "time-dropdown-2018": "UE4 és Unity kísérletek",
    "time-dropdown-content-2018": "Ekkor kezdtem az Unreal Engine és Unity kalandomat. Bár elég hamar abbahagytam a Unity használatát, az Unreal Engine Blueprint rendszerének köszönhetően messzire jutottam a játékrendszerek megértésében és készítésében. Kipróbáltam magam belső nézetes, külső nézetes és autóversenyzős játékokban is, de a modellezési készségeim hiánya miatt egyiket sem sikerült teljesen befejeznem."
}
